/*
 * main.h
 *
 * Created: 11.02.2014 17:51:42
 *  Author: Администратор
 */ 



#ifndef LD_H_
#define LD_H_
//---------------------------------------------------------------------------------------
#define F_CPU 16000000UL // or whatever may be your frequency
//---------------------------------------------------------------------------------------
#include <avr/interrupt.h>
#include <avr/pgmspace.h>
#include <util/delay.h>
#include <avr/eeprom.h>
#include <avr/io.h>
//---------------------------------------------------------------------------------------
#include "usart_debug/buart.h"
#include "init_mcu.h"
#include "buttons.h"
#include "song.h"

#include "TIC5231.h"
//#include "seg_7.h"
//---------------------------------------------------------------------------------------
#define IMP_SET 	(PORTC|=(1<<6));	_delay_us(2);	(PORTC&=~(1<<6));
#define PUMP_CONV 	(PORTC|=(1<<7));	_delay_us(2);	(PORTC&=~(1<<7));

//---------------------------------------------------------------------------------------
// Підключаю глобальні змінні
//---------------------------------------------------------------------------------------
unsigned int count=0x00, time_old=0x00, timer=0x00, time_diff=0x00;
//---------------------------------------------------------------------------------------
struct {unsigned SETT_WORK_1 : 1;                    // Максимальне значення вих. напруги
		unsigned SETT_WORK_2 : 1;
		unsigned HOLD_SPED : 2;
		unsigned HOLD_TIME : 2;
		unsigned HOLD_M_4 : 2;
		unsigned POWER_SETT : 2;} FLAGS;   // Старші біти діапазона кутів
//---------------------------------------------------------------------------------------
/*
void(* resetFunc) (void) = 0; // Reset MC function
//---------------------------------------------------------------------------------------
void Func_reset(void)
{
	// Watchdog Timer initialization
	// Watchdog Timer Prescaler: OSC/16k
	WDTCR=0x08;
	while (1)
	{
	};
};
*/
//---------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------
#endif /* LD_H_ */